DescriptorFile.xml

<?xml version="1.0" encoding="utf-8" ?>

<synapse-unit-test>

    <artifact-file>SampleTestCases/seq.xml</artifact-file>

    <test-cases>
        <test-case>
            <input-payload>
                <![CDATA[
                        <soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ser="http://services.samples" xmlns:xsd="http://services.samples/xsd">
                           <soapenv:Header />
                           <soapenv:Body>
                              <ser:getQuote>
                                 <!--Optional:-->
                                 <ser:request>
                                    <!--Optional:-->
                                    <xsd:symbol>WSO2</xsd:symbol>
                                 </ser:request>
                              </ser:getQuote>
                           </soapenv:Body>
                        </soapenv:Envelope>
                ]]>
            </input-payload>

            <assertion>
                <expected-properties>
                    {
                    "WHERE":"before doing stuff",
                    "SAJITHA":"yes did it"
                    }
                </expected-properties>

                <expected-payload>
                    <![CDATA[
                    <soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://services.samples/xsd" xmlns:ser="http://services.samples">
                       <soapenv:Header/>
                       <soapenv:Body>
                          <ser:getQuote  >
                             <!--Optional:-->
                             <ser:request>
                                <!--Optional:-->
                                <xsd:symbol>WSO2</xsd:symbol>
                                <xsd:symbol>SUN</xsd:symbol>
                             </ser:request>
                          </ser:getQuote  >
                       </soapenv:Body>
                    </soapenv:Envelope>
                ]]>
                </expected-payload>
            </assertion>
        </test-case>
    </test-cases>

</synapse-unit-test>
